
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_backup_policy_vm.darts-migration-backup
  * azurerm_recovery_services_vault.darts-migration-backup


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_backup_policy_vm.darts-migration-backup will be created
  + resource "azurerm_backup_policy_vm" "darts-migration-backup" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "darts-prod-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "darts-prod-rsv"
      + resource_group_name            = "darts-migration-stg-rg"
      + timezone                       = "GMT Standard Time"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 5
        }
    }

  # azurerm_recovery_services_vault.darts-migration-backup will be created
  + resource "azurerm_recovery_services_vault" "darts-migration-backup" {
      + classic_vmware_replication_enabled = (known after apply)
      + cross_region_restore_enabled       = false
      + id                                 = (known after apply)
      + immutability                       = (known after apply)
      + location                           = "uksouth"
      + name                               = "darts-prod-rsv"
      + public_network_access_enabled      = true
      + resource_group_name                = "darts-migration-stg-rg"
      + sku                                = "Standard"
      + soft_delete_enabled                = true
      + storage_mode_type                  = "GeoRedundant"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Vars":{}} -->